# 6.	Пребоядисване
# Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта,
# предвид следните цени:
# •	Предпазен найлон - 1.50 лв. за кв. метър
# •	Боя - 14.50 лв. за литър
# •	Разредител за боя - 5.00 лв. за литър
# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон,
# разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа,
# е равна на 30% от сбора на всички разходи за материали.
# Вход
# Входът се чете от конзолата и съдържа точно 4 реда:
# 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
# 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
# 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
# 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
# Изход
# Да се отпечата на конзолата един ред:
# •	"{сумата на всички разходи}"

need_nylon = int(input())
need_paint = int(input())
need_detergent = int(input())
hours_for_work = int(input())

price_for_nylon = (need_nylon + 2) * 1.50
price_for_pain = (need_paint + 1.10) * 14.50
price_for_detergent = need_detergent * 5
price_for_bags = 0.40
final_price_for_job = price_for_nylon + price_for_pain + price_for_detergent + price_for_bags
price_for_workers = (final_price_for_job * 0.3) * hours_for_work
final_price = final_price_for_job + price_for_workers

print(final_price)



