# 5.	Учебни материали
# Учебната година вече е започнала и отговорничката на 10Б клас - Ани трябва да купи определен брой пакетчета
# с химикали,
# пакетчета с маркери, както и препарат за почистване на дъска. Тя е редовна клиентка на една книжарница,
# затова има намаление за нея, което представлява някакъв процент от общата сума. Напишете програма,
# която изчислява колко пари ще трябва да събере Ани, за да плати сметката, като имате предвид следния ценоразпис:
# •	Пакет химикали - 5.80 лв.
# •	Пакет маркери - 7.20 лв.
# •	Препарат - 1.20 лв (за литър)
# Вход
# От конзолата се четат 4 числа:
# •	Брой пакети химикали - цяло число в интервала [0...100]
# •	Брой пакети маркери - цяло число в интервала [0...100]
# •	Литри препарат за почистване на дъска - цяло число в интервала [0…50]
# •	Процент намаление - цяло число в интервала [0...100]

count_pens = int(input())
count_markers = int(input())
detergent_lt = int(input())
percent = int(input())

price_for_pens = count_pens * 5.80
price_for_markers = count_markers * 7.20
price_for_detergent = detergent_lt * 1.20
total_price = price_for_pens + price_for_markers + price_for_detergent
price_with_percent = total_price - (total_price * percent / 100)


print(price_with_percent)
